.PDFs/TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,765)
      - go(https://blazedemo.com/confirmation.php)
      - waitForLinkText(Travel The World): "Clickable"
      - clickByLinkText(Travel The World)
      - waitForName(fromPort): "Clickable"
      - clickByName(fromPort)
      - waitForName(toPort): "Clickable"
      - clickByName(toPort)
      - waitForName(toPort): "Clickable"
      - clickByName(toPort)
      - waitForName(toPort): "Clickable"
      - clickByName(toPort)
      - waitForName(toPort): "Clickable"
      - selectByName(toPort): "Rome"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - 'waitForCSS(tr:nth-of-type(4) .btn)': "Clickable"
      - 'clickByCSS(tr:nth-of-type(4) .btn)'
      - waitForCSS(label.control-label): "Clickable"
      - clickByCSS(label.control-label)
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "Nathan"
      - waitForID(address): "Clickable"
      - typeByID(address): "123 grovee Street"
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - doubleClickByID(city)
      - waitForID(city): "Clickable"
      - typeByID(city): "Los Santos"
      - waitForID(state): "Clickable"
      - typeByID(state): "US"
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "2525"
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "American Express"
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "Diner's Club"
      - 'waitForCSS(div:nth-of-type(7) > .control-label)': "Clickable"
      - 'clickByCSS(div:nth-of-type(7) > .control-label)'
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "14477747888515"
      - waitForID(creditCardMonth): "Clickable"
      - typeByID(creditCardMonth): "13"
      - waitForID(creditCardYear): "Clickable"
      - keysByID(creditCardYear): KEY_UP
      - waitForCSS(html): "Clickable"
      - clickByCSS(html)
      - waitForID(creditCardMonth): "Clickable"
      - typeByID(creditCardMonth): "12"
      - waitForID(creditCardYear): "Clickable"
      - keysByID(creditCardYear): KEY_TAB
      - waitForID(creditCardYear): "Clickable"
      - typeByID(creditCardYear): "2028"
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "Nathan Almeida"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)

  TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Chromium";v="134.0.6998.89", "Not:A-Brand";v="24.0.0.0", "Google
        Chrome";v="134.0.6998.89"
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/index.php
            method: GET
            label: https://blazedemo.com/index.php
            think-time: 0ms
            headers: {}
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 8027ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              fromPort: Paris
              toPort: Rome
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 4013ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              airline: Virgin America
              flight: '12'
              fromPort: Paris
              price: '765.32'
              toPort: Rome
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 36775ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              _token: ''
              address: 123 grovee Street
              cardType: dinersclub
              city: Los Santos
              creditCardMonth: '12'
              creditCardNumber: '14477747888515'
              creditCardYear: '2028'
              inputName: Nathan
              nameOnCard: Nathan Almeida
              state: US
              zipCode: '2525'